app/Controllers/GaleryController.php

    public function show($id): string
    {
        // $this->cachePage(86400);
        $galeryModel = new Galery();
        $content = $galeryModel->find($id);
---
SELECT *
FROM `galery`
WHERE `galery`.`id` = '7'