app/Controllers/Home.php

SELECT `p`.`id`, `p`.`title`, `p`.`description` as `description`, `p`.`image`, `p`.`thumbnail`, `p`.`category`
FROM `products` `p`
SELECT *
FROM `product_variants`
WHERE `product_id` = '9'
ORDER BY `order` ASC
---
    public function product(): string
    {
        $db = \Config\Database::connect();

        // Get all products with their variants
        $query = $db->table('products p')
            ->select('p.id, p.title, p.description as description, p.image, p.thumbnail, p.category')
            ->get();

        $products = $query->getResultArray();

        // For each product, get its variants and format them
        foreach ($products as &$product) {
            // Get variants for this product ordered by 'order'
            $variants = $db->table('product_variants')
                ->where('product_id', $product['id'])
                ->orderBy('order', 'ASC')
                ->get()
                ->getResultArray();

SELECT `p`.`id`, `p`.`slug`, `p`.`title`, `p`.`thumbnail`
FROM `products` `p`
WHERE `p`.`status` = 1
---
    public function product_v2($lang = 'id'): string
    {
        $supported = ['id', 'en', 'cn'];
        $db = \Config\Database::connect();

        // Get all products with their variants
        $query = $db->table('products p')
            ->where('p.status', 1)
            ->select('p.id, p.slug, p.title, p.thumbnail')
            ->get();

        $products = $query->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `title` LIKE '%%' ESCAPE '!'
AND `status` = 1
SELECT `id`, `slug`, `title`, `thumbnail`
FROM `products`
WHERE `title` LIKE '%%' ESCAPE '!'
AND `status` = 1
ORDER BY `sort_order` ASC
 LIMIT 10
---
    public function productList()
    {
        $page = $this->request->getGet('page') ?? 1;
        $keyword = $this->request->getGet('keyword') ?? '';
        $perPage = 10;
        $offset = ($page - 1) * $perPage;

        $db = \Config\Database::connect();
        $builder = $db->table('products')
            ->select('id, slug, title, thumbnail')
            ->like('title', $keyword)
            ->where('status', 1)
            ->orderBy('sort_order', 'ASC');

        $total = $builder->countAllResults(false); // keep query for later
        $products = $builder->limit($perPage, $offset)->get()->getResultArray();

SELECT *
FROM `products`
WHERE `slug` = 'perosotan-5-in-1-kpn-001-1313'
AND `status` = 1
SELECT *
FROM `product_variants`
WHERE `product_id` = '23'
ORDER BY `order` ASC
SELECT *
FROM `product_images`
WHERE `product_id` = '23'
ORDER BY `sort_order` ASC
---
    public function product_detail_v2($slug, $lang = 'id')
    {
        $supported = ['id', 'en', 'cn'];
        $db = \Config\Database::connect();
        $product =  $db->table('products')->where('slug', $slug)->where('status', 1)->get()->getRow();
        if ($product == null) {
            return redirect()->to('/product');
        }
        $variants = $db->table('product_variants')
            ->where('product_id', $product->id)
            ->orderBy('order', 'ASC')
            ->get()
            ->getResultArray();

        $images = $db->table('product_images')
            ->where('product_id', $product->id)
            ->orderBy('sort_order', 'ASC')
            ->get()
            ->getResultArray();