app/Controllers/ProductController.php

    public function index(): string
    {
        $db = \Config\Database::connect();

        // Get all products with their variants
        $query = $db->table('products p')
        ->select('p.id, p.title, p.description as description, p.image, p.thumbnail, p.category')
        ->get();

        $products = $query->getResultArray();

        // For each product, get its variants and format them
        foreach ($products as &$product) {
            // Get variants for this product ordered by 'order'
            $variants = $db->table('product_variants')
                ->where('product_id', $product['id'])
                ->orderBy('order', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT `p`.`id`, `p`.`title`, `p`.`description` as `description`, `p`.`image`, `p`.`thumbnail`
FROM `products` `p`
SELECT *
FROM `product_variants`
WHERE `product_id` = '1'
ORDER BY `order` ASC

            ];

            $productModel = new Product();
            $productId = $productModel->insert($data);
---
INSERT INTO `products` (`title`, `description`, `image`, `category`, `thumbnail`, `created_at`, `updated_at`) VALUES ('kursi', 'tessss', '2025-04-08-16-49-44-product-kursi.jpg', 'toy', '2025-04-08-16-49-44-product-kursi.jpeg', '2025-04-08 16:49:44', '2025-04-08 16:49:44')

                        ];

                        $variantModel = new ProductVariant();
                        $variantModel->insert($data);
---
INSERT INTO `product_variants` (`product_id`, `image`, `title`, `color`, `order`, `created_at`, `updated_at`) VALUES (8, 'var-0-2025-04-08-16-49-44-product-kursi.jpg', 'Biru', '#3498db', 0, '2025-04-08 16:49:44', '2025-04-08 16:49:44')

    public function update($id): ResponseInterface
    {
        date_default_timezone_set('Asia/Jakarta');
        $validation = \Config\Services::validation();

        $validation->setRules([
            'title' => 'required|min_length[3]|max_length[255]',
            'description' => 'required|min_length[3]',
            'category' => 'required|in_list[hdpe,eva,xpe,toy]',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            session()->setFlashdata('successMessage',  json_encode($validation->getErrors()));
            return redirect()->to('/admin/product');
        }

        $updatedData = [];
        $updatedImage = [];

        $productModel = new Product();
        $product = $productModel->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '7'

            }
            $updatedData = ['title' => $this->request->getPost('title'), 'description' => $this->request->getPost('description'),'category' => $this->request->getPost('category')];
            $updatedValue = array_merge($updatedData, $updatedImage);
            $productModel->update($id, $updatedValue);
---
UPDATE `products` SET `title` = '031-11 new!', `description` = 'tes', `category` = 'xpe', `image` = '2025-04-07-16-56-31-product-031-11-new!.jpg', `thumbnail` = '2025-04-07-16-56-31-product-031-11-new!.jpeg', `updated_at` = '2025-04-07 16:56:31'
WHERE `products`.`id` IN ('7')